{"config": [{"config": {"recurrent_dropout": 0.0, "use_bias": true, "unroll": false, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "bias_regularizer": null, "dropout": 0.0, "trainable": true, "go_backwards": false, "kernel_constraint": null, "dtype": "float32", "bias_constraint": null, "units": 128, "return_sequences": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "implementation": 0, "batch_input_shape": [null, 5, 10], "stateful": false, "recurrent_constraint": null, "name": "lstm_3", "recurrent_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "activity_regularizer": null}, "class_name": "LSTM"}, {"config": {"recurrent_dropout": 0.0, "use_bias": true, "unroll": false, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "bias_regularizer": null, "dropout": 0.0, "trainable": true, "go_backwards": false, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 128, "return_sequences": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "implementation": 0, "stateful": false, "recurrent_constraint": null, "name": "lstm_4", "recurrent_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "activity_regularizer": null}, "class_name": "LSTM"}, {"config": {"units": 3, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "trainable": true, "name": "dense_2", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "keras_version": "2.0.3", "backend": "tensorflow", "class_name": "Sequential"}