{"keras_version": "2.0.3", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_regularizer": null, "activation": "tanh", "recurrent_constraint": null, "stateful": false, "bias_regularizer": null, "implementation": 0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "dtype": "float32", "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dropout": 0.0, "return_sequences": true, "unroll": false, "units": 128, "go_backwards": false, "name": "lstm_1", "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "batch_input_shape": [null, 5, 8], "trainable": true, "activity_regularizer": null, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"class_name": "LSTM", "config": {"recurrent_regularizer": null, "activation": "tanh", "recurrent_constraint": null, "stateful": false, "bias_regularizer": null, "implementation": 0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": false, "dropout": 0.0, "unroll": false, "units": 128, "go_backwards": false, "name": "lstm_2", "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "activity_regularizer": null, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"class_name": "Dense", "config": {"name": "dense_1", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 1, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "trainable": true, "activity_regularizer": null}}]}